share/tutorials/dns/dns/box_turb16/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0;
  }
  U
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0;
  }
}
PISO
{
  nCorrectors     2;
  nNonOrthogonalCorrectors 0;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
